<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
    $permissions = [

        'الفواتيــر',
        'قائــمة الفواتيــر',
        'الفواتيــر المدفوعة',
        'الفواتيــر المدفوعة جزئيا',
        'الفواتيــر الغير مدفوعة',
        'أرشيف الفواتيــر',

        'التقــارير',
        'تقــارير الفـواتير',
        'تقــارير العمــلاء',

        'المسـتخدمـين',
        'قائـمـة المسـتخدمـين',
        'صـلاحـيات المسـتخدمـين',

        'الإعــدادات',
        'المنتجــات',
        'الأقســـام',

        'اضافة مستخدم',
        'تعديل مستخدم',
        'حذف مستخدم',

        'عرض صلاحية',
        'اضافة صلاحية',
        'تعديل صلاحية',
        'حذف صلاحية',


        'إضافة فاتوة',
        'حذف الفاتورة',
        'تصدير EXCEL',
        'تغير حالة الدفع',
        'تعديل الفاتورة',
        'ارشفة الفاتورة',
        'طباعةالفاتورة',

// تم التعديل



        'إضافة منتج',
        'تعديل ',
        'حذف ',

        'إضــافة قســم',
        'تعـديـل ',
        'حـــذف ',


        'اضافة مرفق',
        'حذف المرفق',


        'الاشعارات',

];

foreach ($permissions as $permission) {
Permission::create(['name' => $permission]);
}
}
}
